print ("The spirit of an upset piano")
vitek = 0

    print ("В каком городе жил Дэвид Биккенсон?")
    print ("A) Лондон B) Чикаго С) Нью-Йорк D) Лос-Анджелес")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "B":
    vitek += 1
    
    print ("Как познакомились Хильда и Дэвид?")
    print ("A) Они сидели в джаз-клубе в одиночестве B) Были знакомы давно C) Ждали такси под дождем D) Вышли на балкон и курили")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "D":
    vitek += 1

    print ("Какие у Дэвида отношения с родителями?")
    print ("А) У них доверительные отношения B) Он не держит с ними контакта C) Он враждует с ними D) Старается избегать их")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "D":
    vitek += 1

    print ("Какая любимая тональность у Дэвида?")
    print ("A) ми минор B) до мажор C) фа мажор D) си минор")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "A":
    vitek += 1

    print ("Были ли у Хильды и Дэвида идеальные отношения?")
    print ("A) Да B) Нет C) Слишком романтизированные D) Слишком абьюзивные E) Они были здоровыми F) Они были драматизированы")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "B":
    vitek += 1

    print ("В канун какого праздника произошло знакомство Дэвида с Хильдой?")
    print ("A) Рождество B) Хэллоуин C) День рождение кого-то из героев")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "A":
    vitek += 1

    print ("Что случилось у Хильды во время ссоры с Дэвидом и почему она уехала?")
    print ("A) Она уехала по своему желанию B)  Ее мать сильно заболела C) Умер отец D) Непредвиденные обстоятельства")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "B":
    vitek += 1

    print ("Почему Дэвид начал пить и курить?")
    print ("A) Одиночество B) Безысходность C) Постоянная работа в джаз-клубах D) Связь с плохой компанией")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "D":
    vitek += 1

    print ("На каком музыкальном инструменте Дэвид учился играть в детстве?")
    print ("A) Рояль B) Скрипка C) Гитара D) Духовые")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "С":
    vitek += 1

    print ("Чем вдохновилась автор Духа расстроенного рояля для написания данной книги?")
    print ("A) Музыкой B) Была в алкогольном опьянении C) Личной жизнью и ее невезением в романтических отношениях D) Ее партнером")
    shipovnik = input("Введите свой ответ ")
if shipovnik == "С":
    vitek += 1
    
print (vitek)
